# GetDuctFittingAndAccessoryData Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
DuctFittingAndAccessoryPressureDropData..::..GetDuctFittingAndAccessoryData Method
DuctFittingAndAccessoryPressureDropData Class See Also
---
Returns the fitting and accessory information.
**Namespace:** Autodesk.Revit.DB.Mechanical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public DuctFittingAndAccessoryData GetDuctFittingAndAccessoryData()
```

Visual Basic
---
```text
Public Function GetDuctFittingAndAccessoryData As DuctFittingAndAccessoryData
```

Visual C++
---
```text
public:
DuctFittingAndAccessoryData^ GetDuctFittingAndAccessoryData()
```

# See Also
DuctFittingAndAccessoryPressureDropData Class
Autodesk.Revit.DB.Mechanical Namespace